RhinoInside.Revit API Documentation
GeometryDecoder.ToCurve Method (Curve)
 Converts the specified Autodesk.Revit.DB.Curve to an equivalent Rhino.Geometry.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Curve ToCurve(
	this Autodesk.Revit.DB.Curve curve
)
@staticmethod
def ToCurve(
	curve: Autodesk.Revit.DB.Curve
) -> Rhino.Geometry.Curve
Parameters
curve
Type: Autodesk.Revit.DB.Curve
Revit curve to convert.
Return Value
Type: Rhino.Geometry.Curve
Rhino curve that is equivalent to the provided Revit curve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(Curve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve rhinoCurve = revitCurve.ToCurve();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_curve = revit_curve.ToCurve() # type: RG.Curve
 Using ToCurve(Curve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve rhinoCurve = GeometryEncoder.ToCurve(revitCurve)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_curve = GD.ToCurve(revit_curve) # type: RG.Curve
See Also
Reference
GeometryDecoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace